# Пример входных данных
team1_num = 5
team2_num = 6
score_1 = 40
score_2 = 42
team1_time = 1552.512
team2_time = 2153.31451
tasks_total = 82
time_avg = 45.2

# Определение результата соревнования
if score_1 > score_2 or (score_1 == score_2 and team1_time < team2_time):
    challenge_result = 'Победа команды Мастера кода!'
elif score_1 < score_2 or (score_1 == score_2 and team1_time > team2_time):
    challenge_result = 'Победа команды Волшебники данных!'
else:
    challenge_result = 'Ничья!'

# Использование %
print("В команде Мастера кода участников: %d !" % team1_num)
print("Итого сегодня в командах участников: %d и %d !" % (team1_num, team2_num))

# Использование format()
print("Команда Волшебники данных решила задач: {} !".format(score_2))
print("Волшебники данных решили задачи за {:.1f} с !".format(team2_time))

# Использование f-строк
print(f"Команды решили {score_1} и {score_2} задач.")
print(f"Результат битвы: {challenge_result}")
print(f"Сегодня было решено {tasks_total} задач, в среднем по {time_avg:.1f} секунды на задачу!.")

# Код выводит следующий текст на основании предложенных в задании входных данных:

# В команде Мастера кода участников: 5 !
# Итого сегодня в командах участников: 5 и 6 !
# Команда Волшебники данных решила задач: 42 !
# Волшебники данных решили задачи за 2153.3 с !
# Команды решили 40 и 42 задач.
# Результат битвы: Победа команды Волшебники данных!
# Сегодня было решено 82 задач, в среднем по 45.2 секунды на задачу!.
